<a href="https://colab.research.google.com/github/Raphael-Blaize/python-project-for-MTN-Cote-d-Ivoire--to-help-in-upgrade-of-its-infrastructure-strategy/blob/main/Raph's_MTN_Cote_d'Ivoire_cleaning_and_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

MTN Cote d'Ivoire would like to upgrade its technology infrastructure for its mobile users in Ivory Coast. Studying the given dataset, how does MTN Cote d'Ivoire go about the upgrade of its infrastructure strategy within the given cities?

# IMPORTING THE DATASETS INTO THE ENVIRONMENT

In [510]:
import pandas as pd
import numpy as np


#Importing my cells_geo dataset, seprating by (;) with index_col set to zero in-order to pick the column names as they
#are in the original dataset
geo= pd.read_csv("cells_geo.csv", delimiter=";", index_col=0)
geo

#choosing 10 values
geo.head(10)

     VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0    ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1    ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2    ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3   ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4   ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f
5   ASSINIE  In Service    INTERIEUR  ...  NaN  0b4f56438f  8a1e6ce31f
6  KRIKOREA  In Service    INTERIEUR  ...  NaN  041d2504f5  260dbfedc5
7     ABOBO  In Service      ABIDJAN  ...  NaN  a70c1d263b  56306cc7ca
8     ABOBO  In Service      ABIDJAN  ...  NaN  e2d04ea883  56306cc7ca
9     ABOBO         NaN      ABIDJAN  ...  NaN  ee224cd27e  56306cc7ca

[10 rows x 11 columns]

In [511]:
#Importing my Telcom 1 Dataset
Tel1= pd.read_csv("Telcom_dataset.csv")
Tel1

#choosing the first 10 
Tel1.head(10)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
5    data      0  2012-05-06 23:07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  2012-05-06 23:08:02.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
7   Voice      0  2012-05-06 23:08:03.0  ...     19e2e  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  2012-05-06 23:08:05.0  ...     19e2e  0DeimCpZOc  0DeimCpZOc
9     sms      0  2012-05-06 23:08:43.0  ...     19e2e  01MDiY5F89  01MDiY5F89

[10 rows x 10 columns]

In [512]:
#Importing my Telcom 2 Dataset 
Tel2= pd.read_csv("Telcom_dataset2.csv")
Tel2

#choosing the first 10 
Tel1.head(10)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
5    data      0  2012-05-06 23:07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  2012-05-06 23:08:02.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
7   Voice      0  2012-05-06 23:08:03.0  ...     19e2e  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  2012-05-06 23:08:05.0  ...     19e2e  0DeimCpZOc  0DeimCpZOc
9     sms      0  2012-05-06 23:08:43.0  ...     19e2e  01MDiY5F89  01MDiY5F89

[10 rows x 10 columns]

In [513]:
#Importing my Telcom 3 Dataset
Tel3= pd.read_csv("Telcom_dataset3.csv")
Tel3

#choosing the first 10 
Tel1.head(10)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
5    data      0  2012-05-06 23:07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  2012-05-06 23:08:02.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
7   Voice      0  2012-05-06 23:08:03.0  ...     19e2e  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  2012-05-06 23:08:05.0  ...     19e2e  0DeimCpZOc  0DeimCpZOc
9     sms      0  2012-05-06 23:08:43.0  ...     19e2e  01MDiY5F89  01MDiY5F89

[10 rows x 10 columns]

# **INFORMATION SECTION ON THE DATASETS**

In [514]:
#Cheking the information on the datasest
# Getting to understand the Data types and the entries of the datasets 
geo.info()

print("***************************************************************")
Tel1.info()

print("***************************************************************")
Tel2.info()

print("***************************************************************")
Tel3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3974 entries, 0 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3974 non-null   object
 1   STATUS        3907 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3968 non-null   object
 5   LONGITUDE     3974 non-null   float64
 6   LATITUDE      3974 non-null   float64
 7   REGION        3974 non-null   object
 8   AREA          3951 non-null   object
 9   CELL_ID       3974 non-null   object
 10  SITE_CODE     3974 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.6+ KB
***************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
***************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATE_TIME     5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A_NUMBER   5001 non-null   object
 5   DW_B_NUMBER   5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
***************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELLID           5001 non-null   object
 9   SIET_ID          4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

# **CHECKING THE NULL VALUES IN THE DATASETS**

In [515]:
#checking if my cells geo dataset has any null values
geo.isnull().values.any()

True

In [516]:
#checking how many missing values are in my cell_geo dataset in the columns 
geo.isnull().sum()

VILLES           0
STATUS          67
LOCALISATION     0
DECOUPZONE       0
ZONENAME         6
LONGITUDE        0
LATITUDE         0
REGION           0
AREA            23
CELL_ID          0
SITE_CODE        0
dtype: int64

In [517]:
#cheking null values in my telcom 1 dataset 
Tel1.isnull().values.any()

True

In [518]:
#checking how many missing values are in my telcome1 dataset 
Tel1.isnull().sum()

PRODUTC              0
VALUE                0
DATETIME             0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELL_ID              0
SITE_ID            716
dtype: int64

In [519]:
#cheking null values in my telcom21 dataset 
Tel2.isnull().values.any()

True

In [520]:
#checking how many missing values are in my telcome 2 dataset 
Tel2.isnull().sum()

PRODUCT           0
VALUE             0
DATE_TIME         0
CELL_ON_SITE      0
DW_A_NUMBER       0
DW_B_NUMBER       0
COUNTRY_A         0
COUNTRY_B         0
CELL_ID           0
SITE_ID         676
dtype: int64

In [521]:
#checking how many missing values are in my telcome 3 dataset 
Tel3.isnull().values.any()

True

In [522]:
#checking how many missing values are in my telcome 3 dataset 
Tel3.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELLID               0
SIET_ID            605
dtype: int64

# **CLEANING MY DATA**

 1 .**Taking care of missing data**

In [523]:
# taking care of missing data in my cells_geo dataset by replacing the nan with .
geo2 = geo.replace(np.nan, ".", regex = True)
geo2

        VILLES      STATUS LOCALISATION  ...          AREA     CELL_ID   SITE_CODE
0       ADJAME  In Service      ABIDJAN  ...             .  fbb2e75af3  0bb492ef17
1       ADJAME  In Service      ABIDJAN  ...             .  1502501d78  0bb492ef17
2       ADJAME  In Service      ABIDJAN  ...             .  0c2e182a0c  0bb492ef17
3      ASSINIE  In Service    INTERIEUR  ...             .  69bdfc69fd  8a1e6ce31f
4      ASSINIE  In Service    INTERIEUR  ...             .  7a1029d2ab  8a1e6ce31f
...        ...         ...          ...  ...           ...         ...         ...
3969  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 11 columns]

In [524]:
#checking if their any missing value in my geo2 dataset
geo2.isnull().sum()

VILLES          0
STATUS          0
LOCALISATION    0
DECOUPZONE      0
ZONENAME        0
LONGITUDE       0
LATITUDE        0
REGION          0
AREA            0
CELL_ID         0
SITE_CODE       0
dtype: int64

In [525]:
#Taking care of missing data in my Telcom 1 Dataset 
Tel1up = Tel1.replace(np.nan, ".", regex=True)
Tel1up

     PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms    100  2012-05-07 00:01:54.0  ...     OTHER  0c2371d9bc  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0  ...     19e2e  5fb791cf56  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  7773627c12  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  3f4af49d6c  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0  ...     19e2e  6f4d9b77a5  ebfc58af70

[5001 rows x 10 columns]

In [526]:
#checking if their any missing value in my Tel1up dataset
Tel1up.isnull().sum()

PRODUTC            0
VALUE              0
DATETIME           0
CELL_ON_SITE       0
DW_A_NUMBER_INT    0
DW_B_NUMBER_INT    0
COUNTRY_A          0
COUNTRY_B          0
CELL_ID            0
SITE_ID            0
dtype: int64

In [527]:
#Taking care of missing data in my Telcom 2 Dataset 
Tel2up = Tel2.replace(np.nan, ".", regex=True)
Tel2up.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [528]:
#checking if their any missing value in my Tel2up dataset
Tel2up.isnull().sum()

PRODUCT         0
VALUE           0
DATE_TIME       0
CELL_ON_SITE    0
DW_A_NUMBER     0
DW_B_NUMBER     0
COUNTRY_A       0
COUNTRY_B       0
CELL_ID         0
SITE_ID         0
dtype: int64

In [529]:
#Taking care of missing data in my Telcom 3 Dataset 
Tel3up = Tel3.replace(np.nan, ".", regex=True)
Tel3up

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0      Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA
...      ...    ...                    ...  ...       ...         ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4997   Voice     62  2012-05-09 00:01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
4999   Voice     30  2012-05-09 00:01:43.0  ...     19e2e  98ed726da2  b4130b54ab
5000   Voice     60  2012-05-09 00:01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[5001 rows x 10 columns]

In [530]:
#checking if their any missing value in my Tel3up dataset
Tel3up.isnull().sum()

PRODUCT            0
VALUE              0
DATE_TIME          0
CELL_ON_SITE       0
DW_A_NUMBER_INT    0
DW_B_NUMBER_INT    0
COUNTRY_A          0
COUNTRY_B          0
CELLID             0
SIET_ID            0
dtype: int64

2. **Taking care of duplicate values**

In [531]:
#cheking for duplicate values in my cell_geo dataset 
geo2.duplicated().sum()

43

In [532]:
#dropping the duplicates in my geo2 dataset and cheking if there any duplicates left 
geo3 = geo2.drop_duplicates()
geo3.duplicated().sum()

0

In [533]:
#cheking for duplicate values in my Tel1 dataset 
#dropping the duplicates
Tel1up.duplicated().sum()

82

In [534]:
#dropping the duplicates in my tel1up dataset and cheking if there any duplicates left 
Tel1upd = Tel1up.drop_duplicates()
Tel1upd.duplicated().sum()

0

In [535]:
#cheking for duplicate values in my Tel2 dataset 
Tel2up.duplicated().sum()

78

In [536]:
#dropping the duplicates in my Tel2up  dataset and cheking if there any duplicates left 
Tel2upd = Tel2up.drop_duplicates()
Tel2upd.duplicated().sum()

0

In [537]:
#cheking for duplicate values in my Tel3 dataset 
#dropping the duplicates
Tel3up.duplicated().sum()

93

In [538]:
#dropping the duplicates in my Tel3up dataset and cheking if there any duplicates left 
Tel3upd = Tel3up.drop_duplicates()
Tel3upd.duplicated().sum()

0

3. **Dropping unnecessary column in the dataset**

In [539]:
#cheking the columns in my geo3 dataset 
geo3.head()

# Columns such as Site_code, latitude, longitude will not help in seeing where the cells were most used in the cities we can go ahead 
#and drop these column 
geo3.drop(columns=["LONGITUDE", "LATITUDE", "CELL_ID"], axis=1, inplace=True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [540]:
#Cheking to see whether the columns have been deleted
geo3

#Renaming my site_code column to match all the other datasets 
geo4 = geo3.rename(columns={'SITE_CODE': 'SITE_ID'})
geo4

        VILLES      STATUS LOCALISATION  ...     REGION          AREA     SITE_ID
0       ADJAME  In Service      ABIDJAN  ...     LAGUNE             .  0bb492ef17
1       ADJAME  In Service      ABIDJAN  ...     LAGUNE             .  0bb492ef17
2       ADJAME  In Service      ABIDJAN  ...     LAGUNE             .  0bb492ef17
3      ASSINIE  In Service    INTERIEUR  ...  SUD COMOE             .  8a1e6ce31f
4      ASSINIE  In Service    INTERIEUR  ...  SUD COMOE             .  8a1e6ce31f
...        ...         ...          ...  ...        ...           ...         ...
3969  ZUENOULA  In Service    INTERIEUR  ...   MARAHOUE  CENTRE NORTH  f91ed8d2e9
3970  ZUENOULA  In Service    INTERIEUR  ...   MARAHOUE  CENTRE NORTH  f91ed8d2e9
3971  ZUENOULA  In Service    INTERIEUR  ...   MARAHOUE  CENTRE NORTH  61bee9c70c
3972  ZUENOULA  In Service    INTERIEUR  ...   MARAHOUE  CENTRE NORTH  61bee9c70c
3973  ZUENOULA  In Service    INTERIEUR  ...   MARAHOUE  CENTRE NORTH  61bee9c70c

[3931 rows x 8 columns]

  b) **. Dropping in Telcome datasets**

In [541]:
#cheking the columns in my tel1 dataset 
Tel1upd.head()

#Columns such as DW_A_NUMBER_INT,	DW_B_NUMBER_INT,	COUNTRY_A,	COUNTRY_B,	CELL_ID,	SITE_ID are not needed to find out which cells were most used in the cities
Tel1upd.drop(columns= ["DW_A_NUMBER_INT",	"DW_B_NUMBER_INT",	"COUNTRY_A",	"COUNTRY_B", "CELL_ID"], axis= 1, inplace= True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [542]:
#Cheking to see whether the columns have been deleted
Tel1upd
#renaming the cell id column to match the other telecome datasets 
Tel1upda = Tel1upd.rename(columns={'PRODUTC': 'PRODUCT'})
Tel1upda

     PRODUCT  VALUE               DATETIME CELL_ON_SITE     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0            1  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0            0  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0            0  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0            1  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0            1  051KhYDCpv
...      ...    ...                    ...          ...         ...
4996     sms    100  2012-05-07 00:01:54.0            0  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0            1  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0            1  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0            0  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0            2  ebfc58af70

[4919 rows x 5 columns]

In [543]:
#cheking the columns in my tel1 dataset 
Tel2upd.head()

#Columns such as DW_A_NUMBER,	DW_B_NUMBER,	COUNTRY_A,	COUNTRY_B,	CELL_ID,	SITE_ID are not needed to find out which cells were most used in the cities
Tel2upd.drop(columns= ["DW_A_NUMBER",	"DW_B_NUMBER",	"COUNTRY_A",	"COUNTRY_B", "CELL_ID"], axis= 1, inplace= True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [544]:
#Cheking to see whether the columns have been deleted
Tel2upd

     PRODUCT  VALUE              DATE_TIME CELL_ON_SITE     SITE_ID
0        sms      0  2012-05-07 23:02:06.0            2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0            1  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0            0  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0            1  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0            1  +bO+qkSonO
...      ...    ...                    ...          ...         ...
4995     sms     25  2012-05-08 00:01:53.0            0  eefd93f0b4
4996     sms      0  2012-05-08 00:01:53.0            8  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0            0  211015b14d
4998     sms      0  2012-05-08 00:01:53.0            0  c7ea989264
4999    data      0  2012-05-08 00:01:53.0            _           .

[4923 rows x 5 columns]

In [545]:
#cheking the columns in my tel1 dataset 
Tel3upd.head()

#Columns such as DW_A_NUMBER,	DW_B_NUMBER,	COUNTRY_A,	COUNTRY_B,	CELL_ID,	SITE_ID are not needed to find out which cells were most used in the cities
Tel3upd.drop(columns= ["DW_A_NUMBER_INT",	"DW_B_NUMBER_INT",	"COUNTRY_A",	"COUNTRY_B", "CELLID"], axis= 1, inplace= True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [546]:
#Cheking to see whether the columns have been deleted
Tel3upd
#renaming the cell id column to match the other telecome datasets 
Tel3upda = Tel3upd.rename(columns={'SIET_ID': 'SITE_ID'})
Tel3upda

     PRODUCT  VALUE              DATE_TIME CELL_ON_SITE     SITE_ID
0      Voice     61  2012-05-08 23:01:28.0            2  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0            1  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0            1  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0            0  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0            4  /eeMklgyJA
...      ...    ...                    ...          ...         ...
4995   Voice     10  2012-05-09 00:01:43.0            0  8a96bae9c1
4996   Voice      0  2012-05-09 00:01:43.0            3  f7d63a29e5
4997   Voice     62  2012-05-09 00:01:43.0            1  b4ddb9e93c
4999   Voice     30  2012-05-09 00:01:43.0            2  b4130b54ab
5000   Voice     60  2012-05-09 00:01:43.0            2  6d70dae094

[4908 rows x 5 columns]

# **MERGING DATASETS**

In [547]:
#Merging Datasests Together 
# Merging my geo_cells dataset to my tel1 dataset with the column SITE_ID as the common column 
merge1 = geo4.merge(Tel1upda, how="left", on = 'SITE_ID')
#Merging my merge to the Telcome 2 dataset with the same common column
merge2 = merge1.merge(Tel2upd, how="left", on = 'SITE_ID')
#Merging my merge2 to the Telcome 3 dataset with the same common column
MTN = merge2.merge(Tel3upda, how="left", on="SITE_ID")
MTN

           VILLES      STATUS  ...            DATE_TIME_y CELL_ON_SITE
0          ADJAME  In Service  ...                    NaN          NaN
1          ADJAME  In Service  ...                    NaN          NaN
2          ADJAME  In Service  ...                    NaN          NaN
3         ASSINIE  In Service  ...                    NaN          NaN
4         ASSINIE  In Service  ...                    NaN          NaN
...           ...         ...  ...                    ...          ...
1790363  ZUENOULA  In Service  ...  2012-05-09 00:01:37.0            1
1790364  ZUENOULA  In Service  ...  2012-05-09 00:00:12.0            1
1790365  ZUENOULA  In Service  ...  2012-05-09 00:00:24.0            1
1790366  ZUENOULA  In Service  ...  2012-05-09 00:01:00.0            1
1790367  ZUENOULA  In Service  ...  2012-05-09 00:01:37.0            1

[1790368 rows x 20 columns]

a) **Taking care of unnecessary columns, missing data and duplicate values**

In [548]:
#Dropping columns that are not needed
MTN.drop(columns=["SITE_ID", "CELL_ON_SITE_y", "PRODUCT_x", "VALUE_x", 'CELL_ON_SITE_x',	'PRODUCT_y',	'VALUE_y',	'DATE_TIME_x', 'DATE_TIME_y'], axis=0, inplace=True)
MTN

           VILLES      STATUS LOCALISATION  ... PRODUCT VALUE CELL_ON_SITE
0          ADJAME  In Service      ABIDJAN  ...     NaN   NaN          NaN
1          ADJAME  In Service      ABIDJAN  ...     NaN   NaN          NaN
2          ADJAME  In Service      ABIDJAN  ...     NaN   NaN          NaN
3         ASSINIE  In Service    INTERIEUR  ...     NaN   NaN          NaN
4         ASSINIE  In Service    INTERIEUR  ...     NaN   NaN          NaN
...           ...         ...          ...  ...     ...   ...          ...
1790363  ZUENOULA  In Service    INTERIEUR  ...     sms   0.0            1
1790364  ZUENOULA  In Service    INTERIEUR  ...   Voice   0.0            1
1790365  ZUENOULA  In Service    INTERIEUR  ...     sms   0.0            1
1790366  ZUENOULA  In Service    INTERIEUR  ...   Voice  34.0            1
1790367  ZUENOULA  In Service    INTERIEUR  ...     sms   0.0            1

[1790368 rows x 11 columns]

In [549]:
#Cheking the total of rows with missing data
MTN.isnull().sum()
#dropping rows that contain missing data
mtnf= MTN.dropna()

In [550]:
# Taking care of duplicate values in the dataset
mtnf.duplicated().sum()
MTNfinal = mtnf.drop_duplicates()
MTNfinal.head()

   VILLES      STATUS LOCALISATION  ... PRODUCT VALUE CELL_ON_SITE
7   ABOBO  In Service      ABIDJAN  ...   Voice   8.0            0
8   ABOBO  In Service      ABIDJAN  ...     sms  50.0            4
11  ABOBO  In Service      ABIDJAN  ...     sms   0.0            5
12  ABOBO  In Service      ABIDJAN  ...     sms  25.0            0
13  ABOBO  In Service      ABIDJAN  ...   Voice   8.0            0

[5 rows x 11 columns]

In [551]:
#Looking at the information of my final dataset 
MTNfinal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14335 entries, 7 to 1790190
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        14335 non-null  object
 1   STATUS        14335 non-null  object
 2   LOCALISATION  14335 non-null  object
 3   DECOUPZONE    14335 non-null  object
 4   ZONENAME      14335 non-null  object
 5   REGION        14335 non-null  object
 6   AREA          14335 non-null  object
 7   DATETIME      14335 non-null  object
 8   PRODUCT       14335 non-null  object
 9   VALUE         14335 non-null  float64
 10  CELL_ON_SITE  14335 non-null  object
dtypes: float64(1), object(10)
memory usage: 1.3+ MB

# **DERIVING NEW ATTRIBUTES/DATA ANALYSIS**



1. Which Cities had the highest billing?
2. The city with the most cells?
2. Which cities were the most used during business and home hours?
3. Most used city for the three days?
4. Which product is the most used in the cities
5. Which city had the most value in product
6. Which city had the most cells on site?

In [552]:
#Descriptive statistics between our city and Values column 
MTNfinal['VALUE'].groupby(MTNfinal['VILLES']).describe()

                count        mean         std  ...    50%     75%     max
VILLES                                         ...
ABENGOUROU       49.0   63.632653  116.573956  ...   25.0   25.00   480.0
ABOBO          1670.0   32.008982   65.773541  ...   24.0   33.00   540.0
ABOISSO          20.0    8.200000    6.271070  ...    7.0    8.00    19.0
ABOISSO COMOE     2.0    0.000000    0.000000  ...    0.0    0.00     0.0
ADIAKE            2.0   56.500000   44.547727  ...   56.5   72.25    88.0
...               ...         ...         ...  ...    ...     ...     ...
ZADDI             3.0    0.000000    0.000000  ...    0.0    0.00     0.0
ZAGNE             1.0  120.000000         NaN  ...  120.0  120.00   120.0
ZAMBAKRO          2.0  520.500000  709.228102  ...  520.5  771.25  1022.0
ZIKISSO           6.0   55.000000   60.249481  ...   55.0  110.00   110.0
ZUENOULA         45.0    5.288889   12.461983  ...    0.0    0.00    34.0

[158 rows x 8 columns]

In [556]:
#Cheking which cities was used the most using the Value column
#in description the value column is the billing price so the city with the highest billing price probably had the most users
Cityv = MTNfinal['VILLES'].groupby(MTNfinal['VALUE'])
MTNfinal

# Displaying the max value of the each city
Cityv.max().tail()

VALUE
1022.0        ZAMBAKRO
1036.0     TREICHVILLE
1052.0    GRAND-BASSAM
2120.0     TREICHVILLE
6750.0          COCODY
Name: VILLES, dtype: object

In [624]:
# Finding which cities were the most used during business and home hours 
cityh = MTNfinal["VILLES"].groupby(MTNfinal["DATETIME"])
MTNfinal

#Displaying the most used city during the different hours
cityh.max().tail()

DATETIME
2012-05-07 00:01:50.0         ABOBO
2012-05-07 00:01:51.0    ABENGOUROU
2012-05-07 00:01:52.0         ABOBO
2012-05-07 00:01:53.0         ABOBO
2012-05-07 00:01:54.0        ADJAME
Name: VILLES, dtype: object

In [617]:
#Finding the city with the least cells 
cityp = MTNfinal["VILLES"].groupby(MTNfinal["CELL_ON_SITE"])
MTNfinal

#Displaying the most used city with least cells
cityp.min().head()

CELL_ON_SITE
0    ABENGOUROU
1    ABENGOUROU
2    ABENGOUROU
3         ABOBO
4    ABENGOUROU
Name: VILLES, dtype: object

In [614]:
#Stats to find the most used city in the three days
freq = MTNfinal["VILLES"].value_counts() 
print(freq)

YOPOUGON        2430
ABOBO           1670
ADJAME          1104
YAMOUSSOUKRO    1035
COCODY           792
                ...
DAHIRI             1
MADINANI           1
ALERIA             1
KOLIA              1
BODO               1
Name: VILLES, Length: 158, dtype: int64

In [608]:
#Which product is the most used in the cities
MTNfinal['VILLES'].groupby(MTNfinal['PRODUCT']).describe()

        count unique       top  freq
PRODUCT
Voice    8164    134  YOPOUGON  1458
sms      6171    102  YOPOUGON   972

In [626]:
freq = MTNfinal["PRODUCT"].value_counts() 
print(freq)

Voice    8164
sms      6171
Name: PRODUCT, dtype: int64